[{"sender_name":"Bilal Hasson","timestamp_ms":1599738870028,"content":"All the vitamins and minerals a growing man needs ah.","type":"Generic","is_unsent":false},{"sender_name":"Bilal Hasson","timestamp_ms":1599738849555,"type":"Generic","is_unsent":false},{"sender_name":"Bilal Hasson","timestamp_ms":1599738798661,"content":"That’s what I did this morning yes. It does sound gross haha but tastes so soulful and good. \n\nWow that’s early! I like your morning so far! Banana for breakfast you dirty girl! Haha","reactions":[{"reaction":"❤️","actor":"Genevieve Hasson"},{"reaction":"❤️","actor":"Genevieve Hasson"}],"type":"Generic","is_unsent":false},{"sender_name":"Bilal Hasson","timestamp_ms":1599738705349,"content":"Who said they had to be mutually exclusive? 😏 \n\nYou are special to me.\n\nI have difficulty believing anyone could love my mind, but you might just make a believer of me. Definitely not the sexiest organ, hands down that award would go to you... multiple times. \n\nYou have an equestrian background? Now I’m very intrigued. I do have a desire to see your naked body ride me, I only think about it at least twice a day... that’s not too often is it? I think it’s often enough. \n\nUnfortunately I wasn’t able to take care of it, I was late for my call. Which is unfortunate because I was thinking about you at the time, and it would have felt soooo good! I’m glad you’re always willing to take care of me. Seeing how you woke up the same, can I ask if you pleased yourself this morning, and if so, how did it feel?","type":"Generic","is_unsent":false},{"sender_name":"Genevieve Hasson","timestamp_ms":1599737621168,"content":"Reacted ❤️ to your message","type":"Generic","is_unsent":false},{"sender_name":"Genevieve Hasson","timestamp_ms":1599737617300,"content":"Would your wish be to dine with me?  Or dine on me (well on my sex).\n\nI appreciate your desire...(yes innuendo) to be romantic.  It’s very sweet of you and makes me feel very special.\n\nI love that you enjoy my mind.  I feel the same about you.  Yes physical attraction is nice.  But the brain is really is a “sexy organ.”  Not the sexiest looking organ.....that goes to something else.\n\nYou really have a desire to be ridden.  Is it because of my equestrian background? Did you wake up hard and “take care” of it?  You know I will always be willing to take care of your needs...I woke up in a similar fashion to you.  \n\nSo you roll out of bed and work.  Fish noodles sounds gross!  I woke at 5:30.  Did some yoga and a quick run.  Breakfast is coffee and a banana.","type":"Generic","is_unsent":false},{"sender_name":"Bilal Hasson","timestamp_ms":1599737325298,"content":"Genevieve, you are lovely every second! 😘","reactions":[{"reaction":"❤️","actor":"Genevieve Hasson"},{"reaction":"❤️","actor":"Genevieve Hasson"}],"type":"Generic","is_unsent":false},{"sender_name":"Genevieve Hasson","timestamp_ms":1599737087843,"content":"Reacted ❤️ to your message","type":"Generic","is_unsent":false},{"sender_name":"Genevieve Hasson","timestamp_ms":1599737086920,"content":"Bilal, you so lovely this morning!","reactions":[{"reaction":"❤️","actor":"Bilal Hasson"},{"reaction":"❤️","actor":"Bilal Hasson"}],"type":"Generic","is_unsent":false},{"sender_name":"Bilal Hasson","timestamp_ms":1599737046084,"content":"😏 just for you baby. \n\nAwh that’s good! I’m glad you have good friends you can call on.   If I could have a single wish fulfilled this year, it would be to dine with you. \n\nYes exactly! So I may not be the romantic poet as such, but I’d still make the effort for you. \n\nYou’re most welcome darling, I love looking through your profile, it gives me a better idea of not just who you show the world you are, but also, how you think... you truly fascinate me. \n\nI’ll remember that, so when we’re having a picnic somewhere on a beach, I’ll say “fuck me” and make you ride me.  \n\nI’m glad you slept well, I woke up feeling hard, I’d imagine you would have taken care of that for me. Hmmm, I like guessing! \n\nMy day is progressing rather slowly, it seems this training is going to stretch for a lifetime. I awoke around 9, then logged on for work. I had coffee for breakfast haha. I’m about to make some fish noodles for lunch.\nHow is your day? When did you wake? And what are you having for breakfast?","type":"Generic","is_unsent":false},{"sender_name":"Genevieve Hasson","timestamp_ms":1599734929626,"content":"Ok first off let’s talk about- “my hard phallus filling your sex.”  You sound so incredibly proper and yet it sounds so sexy! \n\nI have a small group of 7-8 people that I can call to spend time with.  Remi is always my go to “plus one.”  I do wish that I could go to dinner with you.\n\nI understand sometimes it’s hard to put into words what you think or feel.  And let’s be honest sometimes, another person’s words capture your feelings perfectly\n\nI wanted to say thank you for commenting on a few photos. You are so sweet to take the time to listen and do that.  \n\nYou can tell me to “fuck you” anytime.  I did sleep well and I did think about you.  I’d share what thoughts I had.....\nBut it’s more fun to keep you guessing.\n\nHow is your day going?  What time did you wake up?  What did you have for breakfast?","type":"Generic","is_unsent":false},{"sender_name":"Bilal Hasson","timestamp_ms":1599725495701,"content":"Haha it’s quite amusing isn’t it. I like that you played with your pussy for me. \n\nI like that you enjoy my hard phallus filling your sex. \n\nYeah I get you. But hey! Free food haha. Have you made a group of friends since being there that you can have a dinner and be genuine with? And if so how often do you go out with them?\n\nI’d much prefer you in bed with me too. Yes to everything! \n\nI may feel certain ways about you, however, I don’t always know how to put them into words, so at times they may be my words... and at other times, I see something that explains what I feel when I can’t find the words... 😘\n\nI did sleep well thank you gorgeous, never in my lifetime would I be telling you to ‘fuck off’. I might tell you to “fuck me”... \n\nHope you’re enjoying your sleep 😴","type":"Generic","is_unsent":false},{"sender_name":"Genevieve Hasson","timestamp_ms":1599704153900,"content":"I still have some tea from home....I need a proper cup of tea!","type":"Generic","is_unsent":false},{"sender_name":"Genevieve Hasson","timestamp_ms":1599704108717,"type":"Generic","is_unsent":false},{"sender_name":"Genevieve Hasson","timestamp_ms":1599698787670,"content":"You look so adorable in that photo!  I love the eye mask on you and the “Fuck Off” makes it so perfect. I played with my pussy for you and to was quite wonderful.  A good time was had by all.\n\nI do enjoy the notion of you having a nice hard cock and filling my pussy with it.\n\nThe event was fine.  I can schmooze and make small talk, but it’s not what I enjoy. I don’t like situations where I feel people are not genuine.\n\nI’d much prefer to be with you in bed.  I love to have you undress me. I’d love to be tickled by you.  I’d love to hear you tell me about your day also.  \n\nThat poem- did you write it?  It is truly beautiful. It makes me smile. \n\nSleep well my darling Bilal and please don’t tell me to “fuck off” if I meet you in your dreams 😘","reactions":[{"reaction":"❤️","actor":"Bilal Hasson"},{"reaction":"❤️","actor":"Bilal Hasson"}],"type":"Generic","is_unsent":false},{"sender_name":"Genevieve Hasson","timestamp_ms":1599698304941,"content":"Reacted ❤️ to your message","type":"Generic","is_unsent":false},{"sender_name":"Genevieve Hasson","timestamp_ms":1599698276198,"content":"Reacted ❤️ to your message","type":"Generic","is_unsent":false},{"sender_name":"Genevieve Hasson","timestamp_ms":1599698274809,"content":"Reacted ❤️ to your message","type":"Generic","is_unsent":false}]